app/controllers/matter_controller.rb

  def test
    @matters = Matter.all
---
SELECT "matters".* FROM "matters"

  def production
    @matters = Matter.all
---
SELECT "matters".* FROM "matters"

  def list
    @matters = Matter.all
---
SELECT "matters".* FROM "matters"

  def create
    @matter = Matter.new(
      name: params[:name],
      english: params[:english],
      rap: params[:rap],
      domain: params[:domain],
      rwd: params[:rwd].to_i,
      ssl: params[:ssl].to_i
    )
    if @matter.save
---
INSERT INTO "matters" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "田中歯科"], ["created_at", "2021-01-09 10:27:42.418677"], ["updated_at", "2021-01-09 10:27:42.418677"]]

  def edit
    @matter = Matter.find_by(id: params[:id])
---
SELECT  "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]

  def update
    @matter = Matter.find_by(id: params[:id])
    @matter.name = params[:name]
    @matter.english = params[:english]
    @matter.rap = params[:rap]
    @matter.domain = params[:domain]
    @matter.rwd = params[:rwd].to_i
    @matter.ssl = params[:ssl].to_i
    if @matter.save
---
SELECT  "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT ?  [["id", 93], ["LIMIT", 1]]
UPDATE "matters" SET "rwd" = ?, "ssl" = ?, "updated_at" = ? WHERE "matters"."id" = ?  [["rwd", 1], ["ssl", 1], ["updated_at", "2021-01-16 09:07:08.272236"], ["id", 93]]

  def destroy
    @matter = Matter.find_by(id: params[:id])
    @matter.destroy
---
SELECT  "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
DELETE FROM "matters" WHERE "matters"."id" = ?  [["id", 89]]