app/models/matter.rb

  def self.import(file)
    xlsx = Roo::Excelx.new(file.tempfile)
    xlsx.each_row_streaming(offset: 1) do |row|
      matter = self.new(
        name: row[0].value,
        english: row[1].value,
        rap: row[2].value,
        domain: row[3].value,
        rwd: row[4].value,
        ssl: row[5].value
      )
      next if self.pluck(:id).include?(matter.id)
      matter.save
---
SELECT "matters"."id" FROM "matters"
INSERT INTO "matters" ("name", "created_at", "updated_at", "english", "rap", "domain", "rwd", "ssl") VALUES (?, ?, ?, ?, ?, ?, ?, ?)